# Посчитать общее количество определенных цифр в числах
# Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
# Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.
#
# 1. Запросить у пользователя количество вводимых чисел (n) и цифру для подсчета (d).
# 2. Присвоить счетчику цифр значение 0.
# 3. Выполнить n раз цикл, в теле которого
#   1. запрашивать очередное число,
#   2. пока это число не сократиться до нуля
#       1. извлекать последнюю его цифру и сравнивать с цифрой, которую надо посчитать,
#       2. увеличивать значение счетчика цифр на 1, если сравниваемые цифры совпадают,
#       3. избавляться от последней цифры числа.
# 4. В конце программы вывести количество посчитанных цифр на экран.

n = int(input("Сколько будет чисел? "))
d = int(input("Какую цифру считать? "))
count = 0
for i in range(1, n + 1):
    m = int(input("Число " + str(i) + ": "))
    while m > 0:
        if m % 10 == d:
            count += 1
        m = m // 10

print("Было введено %d цифр %d" % (count, d))